zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPsi5_reg.h
/** \brief 54, Watch Dog Timer Register 05 */
#define PSI5_CH0_WDT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005054u)
/** Alias (User Manual Name) for PSI5_CH0_WDT5.
* To use register names with standard convension, please use PSI5_CH0_WDT5.
*/
#define PSI5_WDT05 (PSI5_CH0_WDT5)

/** \brief 58, Watch Dog Timer Register 06 */
#define PSI5_CH0_WDT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005058u)
/** Alias (User Manual Name) for PSI5_CH0_WDT6.
* To use register names with standard convension, please use PSI5_CH0_WDT6.
*/
#define PSI5_WDT06 (PSI5_CH0_WDT6)

/** \brief 5C, Receive Status Register 0 */
#define PSI5_CH0_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF000505Cu)
/** Alias (User Manual Name) for PSI5_CH0_RSR.
* To use register names with standard convension, please use PSI5_CH0_RSR.
*/
#define PSI5_RSR0 (PSI5_CH0_RSR)

/** \brief 60, Serial Data and Status Register 00 */
#define PSI5_CH0_SDS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005060u)
/** Alias (User Manual Name) for PSI5_CH0_SDS0.
* To use register names with standard convension, please use PSI5_CH0_SDS0.
*/
#define PSI5_SDS00 (PSI5_CH0_SDS0)

/** \brief 64, Serial Data and Status Register 01 */
#define PSI5_CH0_SDS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005064u)
/** Alias (User Manual Name) for PSI5_CH0_SDS1.
* To use register names with standard convension, please use PSI5_CH0_SDS1.
*/
#define PSI5_SDS01 (PSI5_CH0_SDS1)

/** \brief 68, Serial Data and Status Register 02 */
#define PSI5_CH0_SDS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005068u)
/** Alias (User Manual Name) for PSI5_CH0_SDS2.
* To use register names with standard convension, please use PSI5_CH0_SDS2.
*/
#define PSI5_SDS02 (PSI5_CH0_SDS2)

/** \brief 6C, Serial Data and Status Register 03 */
#define PSI5_CH0_SDS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF000506Cu)
/** Alias (User Manual Name) for PSI5_CH0_SDS3.
* To use register names with standard convension, please use PSI5_CH0_SDS3.
*/
#define PSI5_SDS03 (PSI5_CH0_SDS3)

/** \brief 70, Serial Data and Status Register 04 */
#define PSI5_CH0_SDS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005070u)
/** Alias (User Manual Name) for PSI5_CH0_SDS4.
* To use register names with standard convension, please use PSI5_CH0_SDS4.
*/
#define PSI5_SDS04 (PSI5_CH0_SDS4)

/** \brief 74, Serial Data and Status Register 05 */
#define PSI5_CH0_SDS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005074u)
/** Alias (User Manual Name) for PSI5_CH0_SDS5.
* To use register names with standard convension, please use PSI5_CH0_SDS5.
*/
#define PSI5_SDS05 (PSI5_CH0_SDS5)

/** \brief 78, Start of Pulse Time Stamp Capture Register 0 */
#define PSI5_CH0_SPTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF0005078u)
/** Alias (User Manual Name) for PSI5_CH0_SPTSC.
* To use register names with standard convension, please use PSI5_CH0_SPTSC.
*/
#define PSI5_SPTSC0 (PSI5_CH0_SPTSC)

/** \brief 7C, Start of Frame Time Stamp Capture Register 0 */
#define PSI5_CH0_SFTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000507Cu)
/** Alias (User Manual Name) for PSI5_CH0_SFTSC.
* To use register names with standard convension, please use PSI5_CH0_SFTSC.
*/
#define PSI5_SFTSC0 (PSI5_CH0_SFTSC)

/** \brief 80, Receive Data Register Low 0 */
#define PSI5_CH0_RDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF0005080u)
/** Alias (User Manual Name) for PSI5_CH0_RDRL.
* To use register names with standard convension, please use PSI5_CH0_RDRL.
*/
#define PSI5_RDRL0 (PSI5_CH0_RDRL)

/** \brief 84, Receive Data Register High 0 */
#define PSI5_CH0_RDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF0005084u)
/** Alias (User Manual Name) for PSI5_CH0_RDRH.
* To use register names with standard convension, please use PSI5_CH0_RDRH.
*/
#define PSI5_RDRH0 (PSI5_CH0_RDRH)

/** \brief 88, Pulse Generation Control Register 0 */
#define PSI5_CH0_PGC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF0005088u)
/** Alias (User Manual Name) for PSI5_CH0_PGC.
* To use register names with standard convension, please use PSI5_CH0_PGC.
*/
#define PSI5_PGC0 (PSI5_CH0_PGC)

/** \brief 8C, Channel Trigger Value Register 0 */
#define PSI5_CH0_CTV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF000508Cu)
/** Alias (User Manual Name) for PSI5_CH0_CTV.
* To use register names with standard convension, please use PSI5_CH0_CTV.
*/
#define PSI5_CTV0 (PSI5_CH0_CTV)

/** \brief 90, Send Control Register 0 */
#define PSI5_CH0_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF0005090u)
/** Alias (User Manual Name) for PSI5_CH0_SCR.
* To use register names with standard convension, please use PSI5_CH0_SCR.
*/
#define PSI5_SCR0 (PSI5_CH0_SCR)

/** \brief 94, Send Data Register Low 0 */
#define PSI5_CH0_SDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF0005094u)
/** Alias (User Manual Name) for PSI5_CH0_SDRL.
* To use register names with standard convension, please use PSI5_CH0_SDRL.
*/
#define PSI5_SDRL0 (PSI5_CH0_SDRL)

/** \brief 98, Send Data Register High 0 */
#define PSI5_CH0_SDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF0005098u)
/** Alias (User Manual Name) for PSI5_CH0_SDRH.
* To use register names with standard convension, please use PSI5_CH0_SDRH.
*/
#define PSI5_SDRH0 (PSI5_CH0_SDRH)

/** \brief 9C, Send Shift Register Low 0 */
#define PSI5_CH0_SSRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF000509Cu)
/** Alias (User Manual Name) for PSI5_CH0_SSRL.
* To use register names with standard convension, please use PSI5_CH0_SSRL.
*/
#define PSI5_SSRL0 (PSI5_CH0_SSRL)

/** \brief A0, Send Shift Register High 0 */
#define PSI5_CH0_SSRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF00050A0u)
/** Alias (User Manual Name) for PSI5_CH0_SSRH.
* To use register names with standard convension, please use PSI5_CH0_SSRH.
*/
#define PSI5_SSRH0 (PSI5_CH0_SSRH)

