zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPsi5_reg.h
/** \brief 8D0, Receive Data Memory Low 226 */
#define PSI5_RDM2_26_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058D0u)
/** Alias (User Manual Name) for PSI5_RDM2_26_L.
* To use register names with standard convension, please use PSI5_RDM2_26_L.
*/
#define PSI5_RDML226 (PSI5_RDM2_26_L)

/** \brief 8D4, Receive Data Memory High 226 */
#define PSI5_RDM2_26_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058D4u)
/** Alias (User Manual Name) for PSI5_RDM2_26_H.
* To use register names with standard convension, please use PSI5_RDM2_26_H.
*/
#define PSI5_RDMH226 (PSI5_RDM2_26_H)

/** \brief 8D8, Receive Data Memory Low 227 */
#define PSI5_RDM2_27_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058D8u)
/** Alias (User Manual Name) for PSI5_RDM2_27_L.
* To use register names with standard convension, please use PSI5_RDM2_27_L.
*/
#define PSI5_RDML227 (PSI5_RDM2_27_L)

/** \brief 8DC, Receive Data Memory High 227 */
#define PSI5_RDM2_27_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058DCu)
/** Alias (User Manual Name) for PSI5_RDM2_27_H.
* To use register names with standard convension, please use PSI5_RDM2_27_H.
*/
#define PSI5_RDMH227 (PSI5_RDM2_27_H)

/** \brief 8E0, Receive Data Memory Low 228 */
#define PSI5_RDM2_28_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058E0u)
/** Alias (User Manual Name) for PSI5_RDM2_28_L.
* To use register names with standard convension, please use PSI5_RDM2_28_L.
*/
#define PSI5_RDML228 (PSI5_RDM2_28_L)

/** \brief 8E4, Receive Data Memory High 228 */
#define PSI5_RDM2_28_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058E4u)
/** Alias (User Manual Name) for PSI5_RDM2_28_H.
* To use register names with standard convension, please use PSI5_RDM2_28_H.
*/
#define PSI5_RDMH228 (PSI5_RDM2_28_H)

/** \brief 8E8, Receive Data Memory Low 229 */
#define PSI5_RDM2_29_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058E8u)
/** Alias (User Manual Name) for PSI5_RDM2_29_L.
* To use register names with standard convension, please use PSI5_RDM2_29_L.
*/
#define PSI5_RDML229 (PSI5_RDM2_29_L)

/** \brief 8EC, Receive Data Memory High 229 */
#define PSI5_RDM2_29_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058ECu)
/** Alias (User Manual Name) for PSI5_RDM2_29_H.
* To use register names with standard convension, please use PSI5_RDM2_29_H.
*/
#define PSI5_RDMH229 (PSI5_RDM2_29_H)

/** \brief 8F0, Receive Data Memory Low 230 */
#define PSI5_RDM2_30_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058F0u)
/** Alias (User Manual Name) for PSI5_RDM2_30_L.
* To use register names with standard convension, please use PSI5_RDM2_30_L.
*/
#define PSI5_RDML230 (PSI5_RDM2_30_L)

/** \brief 8F4, Receive Data Memory High 230 */
#define PSI5_RDM2_30_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058F4u)
/** Alias (User Manual Name) for PSI5_RDM2_30_H.
* To use register names with standard convension, please use PSI5_RDM2_30_H.
*/
#define PSI5_RDMH230 (PSI5_RDM2_30_H)

/** \brief 8F8, Receive Data Memory Low 231 */
#define PSI5_RDM2_31_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00058F8u)
/** Alias (User Manual Name) for PSI5_RDM2_31_L.
* To use register names with standard convension, please use PSI5_RDM2_31_L.
*/
#define PSI5_RDML231 (PSI5_RDM2_31_L)

/** \brief 8FC, Receive Data Memory High 231 */
#define PSI5_RDM2_31_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00058FCu)
/** Alias (User Manual Name) for PSI5_RDM2_31_H.
* To use register names with standard convension, please use PSI5_RDM2_31_H.
*/
#define PSI5_RDMH231 (PSI5_RDM2_31_H)

/** \brief 900, Receive Data Memory Low 30 */
#define PSI5_RDM3_0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005900u)
/** Alias (User Manual Name) for PSI5_RDM3_0_L.
* To use register names with standard convension, please use PSI5_RDM3_0_L.
*/
#define PSI5_RDML30 (PSI5_RDM3_0_L)

/** \brief 904, Receive Data Memory High 30 */
#define PSI5_RDM3_0_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005904u)
/** Alias (User Manual Name) for PSI5_RDM3_0_H.
* To use register names with standard convension, please use PSI5_RDM3_0_H.
*/
#define PSI5_RDMH30 (PSI5_RDM3_0_H)

/** \brief 908, Receive Data Memory Low 31 */
#define PSI5_RDM3_1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005908u)
/** Alias (User Manual Name) for PSI5_RDM3_1_L.
* To use register names with standard convension, please use PSI5_RDM3_1_L.
*/
#define PSI5_RDML31 (PSI5_RDM3_1_L)

/** \brief 90C, Receive Data Memory High 31 */
#define PSI5_RDM3_1_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000590Cu)
/** Alias (User Manual Name) for PSI5_RDM3_1_H.
* To use register names with standard convension, please use PSI5_RDM3_1_H.
*/
#define PSI5_RDMH31 (PSI5_RDM3_1_H)

/** \brief 910, Receive Data Memory Low 32 */
#define PSI5_RDM3_2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005910u)
/** Alias (User Manual Name) for PSI5_RDM3_2_L.
* To use register names with standard convension, please use PSI5_RDM3_2_L.
*/
#define PSI5_RDML32 (PSI5_RDM3_2_L)

/** \brief 914, Receive Data Memory High 32 */
#define PSI5_RDM3_2_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005914u)
/** Alias (User Manual Name) for PSI5_RDM3_2_H.
* To use register names with standard convension, please use PSI5_RDM3_2_H.
*/
#define PSI5_RDMH32 (PSI5_RDM3_2_H)

/** \brief 918, Receive Data Memory Low 33 */
#define PSI5_RDM3_3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005918u)
/** Alias (User Manual Name) for PSI5_RDM3_3_L.
* To use register names with standard convension, please use PSI5_RDM3_3_L.
*/
#define PSI5_RDML33 (PSI5_RDM3_3_L)

/** \brief 91C, Receive Data Memory High 33 */
#define PSI5_RDM3_3_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000591Cu)
/** Alias (User Manual Name) for PSI5_RDM3_3_H.
* To use register names with standard convension, please use PSI5_RDM3_3_H.
*/
#define PSI5_RDMH33 (PSI5_RDM3_3_H)

/** \brief 920, Receive Data Memory Low 34 */
#define PSI5_RDM3_4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005920u)
/** Alias (User Manual Name) for PSI5_RDM3_4_L.
* To use register names with standard convension, please use PSI5_RDM3_4_L.
*/
#define PSI5_RDML34 (PSI5_RDM3_4_L)

/** \brief 924, Receive Data Memory High 34 */
#define PSI5_RDM3_4_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005924u)
/** Alias (User Manual Name) for PSI5_RDM3_4_H.
* To use register names with standard convension, please use PSI5_RDM3_4_H.
*/
#define PSI5_RDMH34 (PSI5_RDM3_4_H)

/** \brief 928, Receive Data Memory Low 35 */
#define PSI5_RDM3_5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005928u)
/** Alias (User Manual Name) for PSI5_RDM3_5_L.
* To use register names with standard convension, please use PSI5_RDM3_5_L.
*/
#define PSI5_RDML35 (PSI5_RDM3_5_L)

/** \brief 92C, Receive Data Memory High 35 */
#define PSI5_RDM3_5_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000592Cu)
/** Alias (User Manual Name) for PSI5_RDM3_5_H.
* To use register names with standard convension, please use PSI5_RDM3_5_H.
*/
#define PSI5_RDMH35 (PSI5_RDM3_5_H)

/** \brief 930, Receive Data Memory Low 36 */
#define PSI5_RDM3_6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005930u)
/** Alias (User Manual Name) for PSI5_RDM3_6_L.
* To use register names with standard convension, please use PSI5_RDM3_6_L.
*/
#define PSI5_RDML36 (PSI5_RDM3_6_L)

/** \brief 934, Receive Data Memory High 36 */
#define PSI5_RDM3_6_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005934u)
/** Alias (User Manual Name) for PSI5_RDM3_6_H.
* To use register names with standard convension, please use PSI5_RDM3_6_H.
*/
#define PSI5_RDMH36 (PSI5_RDM3_6_H)

/** \brief 938, Receive Data Memory Low 37 */
#define PSI5_RDM3_7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005938u)
/** Alias (User Manual Name) for PSI5_RDM3_7_L.
* To use register names with standard convension, please use PSI5_RDM3_7_L.
*/
#define PSI5_RDML37 (PSI5_RDM3_7_L)

/** \brief 93C, Receive Data Memory High 37 */
#define PSI5_RDM3_7_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000593Cu)
/** Alias (User Manual Name) for PSI5_RDM3_7_H.
* To use register names with standard convension, please use PSI5_RDM3_7_H.
*/
#define PSI5_RDMH37 (PSI5_RDM3_7_H)

